// Запрашивать данные у пользователя необходимо с помощью 
// prompt(), а выводить результат с помощью alert().
// 1. Запросите у пользователя его имя и выведите в ответ: 
// «Привет, его имя!».

    function greeting(){
        let name = prompt("Как тебя зовут ?", "имя");
        alert(`Привет, ${name}!`);
        
    }
    greeting();
        

// 2. Запросите у пользователя год его рождения, посчитайте, 
// сколько ему лет и выведите результат. Текущий год укажите 
// в коде как константу.

    function calculateAge(){
        let birthYear = prompt("В каком году Вы родились ?", "год рождения");
        const date = new Date();
        const currentYear = date.getFullYear();
        alert(`Привет, Вам исполнилось ${currentYear-birthYear} лет!`);
        
    }
    calculateAge();
// 3. Запросите у пользователя длину стороны квадрата и выведите периметр такого квадрата. 

    function perimeterOfSquare(){
        let length = prompt("Введите длину стороны квадрата (см)", "длина квадрата");
        alert(`Периметр квадрата равен ${length*4} (см)`);
    }
    perimeterOfSquare();
    
// 4. Запросите у пользователя радиус окружности и выведите 
// площадь такой окружности.


// 5. Запросите у пользователя расстояние в км между двумя 
// городами и за сколько часов он хочет добраться. Посчитайте скорость, с которой необходимо двигаться, чтобы 
// успеть вовремя.


// 6. Реализуйте конвертор валют. Пользователь вводит доллары, программа переводит в евро. Курс валюты храните в 
// константе.


// 7. Пользователь указывает объем флешки в Гб. Программа 
// должна посчитать сколько файлов размером в 820 Мб помещается на флешку.


// 8. Пользователь вводит сумму денег в кошельке и цену одной 
// шоколадки. Программа выводит сколько шоколадок может 
// купить пользователь и сколько сдачи у него останется. 


// 9. Запросите у пользователя трехзначное число и выведите 
// его задом наперед. Для решения задачи вам понадобится 
// оператор % (остаток от деления).


// 10. Запросите у пользователя целое число и выведите в ответ, 
// четное число или нет. В задании используйте логические 
// операторы. В задании не надо использовать if или switch.
